GetData.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:api="http://www.elgin.org.uk/schemas/api">
    <soapenv:Header/>
    <soapenv:Body>
        <api:GetData>
            <!--Choose one of the below elements-->
            <EntityOriginatingSystem>roadworks.org</EntityOriginatingSystem>
            <ItemOriginatingSystem>roadworks.org</ItemOriginatingSystem>
            <DataSourceID>7289</DataSourceID>
            <HighwayAuthorityID>1155</HighwayAuthorityID>
            <EntitySourceID>FB013_20000004</EntitySourceID>
            <StartDate>2016-01-16T05:54:00Z</StartDate>
            <EndDate>2017-12-16T05:54:00Z</EndDate>
            <LastUpdated>2016-02-04T05:54:00Z</LastUpdated>
            <EntityGroup>Roadworks</EntityGroup>
            <EntityCategory>Sport Event</EntityCategory>
            <ItemType>Lane closure</ItemType>
        </api:GetData>
    </soapenv:Body>
</soapenv:Envelope>